# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [2]:
# Your code here
import pandas as pd
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"
df = pd.read_csv(url)

In [3]:
df.head(2)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

In [4]:
df.columns = df.columns.str.lower().str.replace(" ", "_")
df.rename(columns = {"st" : "state"}, inplace=True)
df.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

In [5]:
df.nunique()

customer                     1071
state                           8
gender                          5
education                       6
customer_lifetime_value      1027
income                        774
monthly_premium_auto          132
number_of_open_complaints       6
policy_type                     3
vehicle_class                   6
total_claim_amount            761
dtype: int64

In [6]:
df1 = df

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [7]:
# Your code here
df1["gender"].value_counts(), df1["gender"].isna().sum()

(F         457
 M         413
 Male       39
 female     28
 Femal      17
 Name: gender, dtype: int64,
 3054)

In [8]:
def gender(x):
    if x == "Femal" or x == "female":
        return "F"
    elif x == "Male":
        return "M"
    else:
        return x

# gender = {"Male" : "M", "Femal" : "F"} # WITH MAP IT DIDNT WORK
df1["gender"] = df1["gender"].apply(gender)

In [9]:
df1["gender"].value_counts()

F    502
M    452
Name: gender, dtype: int64

In [11]:
# State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"
df1["state"] = df1["state"].apply(lambda x: "California" if x == "Cali" else "Washington" if x == "WA" else "Arizona" if x == "AZ" else x)
df1["state"].value_counts()

California    331
Oregon        320
Arizona       211
Washington    111
Nevada         98
Name: state, dtype: int64

In [14]:
# In education, "Bachelors" could be replaced by "Bachelor"
df1["education"] = df1["education"].apply(lambda x: "Bachelor" if x == "Bachelors" else x)
# OR
# df2["education"] = df2["education"].replace("Bachelors", "Bachelor")
df1["education"].value_counts()

Bachelor                331
College                 313
High School or Below    296
Master                   94
Doctor                   37
Name: education, dtype: int64

In [16]:
# In Customer Lifetime Value, delete the % character
df1["customer_lifetime_value"] = df1["customer_lifetime_value"].str.replace("%", "") # we used str here but not in above cell cause % is part of the string not the whole cell. 
df1["customer_lifetime_value"].head(10)

0           NaN
1     697953.59
2    1288743.17
3     764586.18
4     536307.65
5     825629.78
6     538089.86
7     721610.03
8    2412750.40
9     738817.81
Name: customer_lifetime_value, dtype: object

In [17]:
# In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"
df1[["vehicle_class"]].replace(["Luxury Car", "Sports Car", "Luxury SUV"], "Luxury").value_counts()
# df2[["vehicle_class"]].value_counts()

vehicle_class
Four-Door Car    576
Two-Door Car     205
SUV              199
Luxury            91
dtype: int64

In [20]:
df1.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [26]:
# Your code here

# Customer lifetime value should be numeric

df1['customer_lifetime_value'] = df1['customer_lifetime_value'].astype(float)
df1['customer_lifetime_value'].dtypes

dtype('float64')

In [195]:
def slash(x):
    
    if len(str(x).split('/')) > 1:
        return str(x).split('/')[1]
    else:
        return x

    
df1['number_of_open_complaints'].apply(slash).head(10)
df1['number_of_open_complaints'] = df1['number_of_open_complaints'].apply(slash).head(10)
df1.head(3)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.00,1000.00,0,Personal Auto,Four-Door Car,2.70
1,QZ44356,Arizona,F,Bachelor,697953.59,0.00,94.00,0,Personal Auto,Four-Door Car,1131.46
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.00,108.00,0,Personal Auto,Two-Door Car,566.47

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [70]:
# Your code here
# Drop the rows or columns with null values
# The last 2937 rows are null for all columns. which means we can remove them.

(customer                     2937
 state                        2937
 gender                       3054
 education                    2937
 customer_lifetime_value      2940
 income                       2937
 monthly_premium_auto         2937
 number_of_open_complaints    2937
 policy_type                  2937
 vehicle_class                2937
 total_claim_amount           2937
 dtype: int64,
 True     2937
 False    1071
 Name: customer, dtype: int64)

In [196]:
df1.tail(2950).isna().sum()

customer                     2937
state                        2937
gender                       2937
education                    2937
customer_lifetime_value      2937
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2950
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [197]:
df1[-2940:].head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1068,GS98873,Arizona,F,Bachelor,323912.47,16061.00,88.00,NaN,Personal Auto,Four-Door Car,633.60
1069,CW49887,California,F,Master,462680.11,79487.00,114.00,NaN,Special Auto,SUV,547.20
1070,MY31220,California,F,College,899704.02,54230.00,112.00,NaN,Personal Auto,Two-Door Car,537.60
1071,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1072,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [198]:
df2 = df1[:1071]
df2.isna().sum()

# Fill the null values with a specific value (such as the column mean or median for numerical 
# variables, and mode for categorical variables)

# only 2 columns left with null values: 'gender' and 'customer_lifetime_value'

# gender nulls filled by mode
df2['gender'].value_counts()
df2.gender = df2.gender.fillna(df2.gender.mode())

# customer_lifetime_value nulls filled by mean
df2.customer_lifetime_value = df2.customer_lifetime_value.fillna(df2.customer_lifetime_value.mean().round(2))
df2.customer_lifetime_value

C:\Users\ASDE57~1.A\AppData\Local\Temp/ipykernel_10464/568588918.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.gender = df2.gender.fillna(df2.gender.mode())
C:\Users\ASDE57~1.A\AppData\Local\Temp/ipykernel_10464/568588918.py:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.customer_lifetime_value = df2.customer_lifetime_value.fillna(df2.customer_lifetime_value.mean().round(2))

0       793690.26
1       697953.59
2      1288743.17
3       764586.18
4       536307.65
          ...
1066    305955.03
1067   2031499.76
1068    323912.47
1069    462680.11
1070    899704.02
Name: customer_lifetime_value, Length: 1071, dtype: float64

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [199]:
# Your code here

df2[df2.duplicated()].isna().sum(), print('total duplicated: ', len(df2[df2.duplicated()]))

# after cleaning the data, there doesnt seem to be left any duplicated row except the NaN rows. interestingly duplicated() 
# is considering NaN rows as duplicate.

total duplicated:  0

(customer                    0.00
 state                       0.00
 gender                      0.00
 education                   0.00
 customer_lifetime_value     0.00
 income                      0.00
 monthly_premium_auto        0.00
 number_of_open_complaints   0.00
 policy_type                 0.00
 vehicle_class               0.00
 total_claim_amount          0.00
 dtype: float64,
 None)

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [ ]:
# Your code here

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [190]:
df2[['customer_lifetime_value', 'total_claim_amount']].describe()

       customer_lifetime_value  total_claim_amount
count                  1071.00             1071.00
mean                 793690.26              404.99
std                  642575.70              293.03
min                  200435.07                0.38
25%                  404853.46              202.16
50%                  588718.20              354.73
75%                  894520.99              532.80
max                 5816655.35             2893.24

In [220]:
# Your code here
pd.set_option('display.float_format', '{:.2f}'.format)
df2[['customer_lifetime_value', 'total_claim_amount']].describe()

df3 = df2[(df2['total_claim_amount'] > 532.80) & (df2['customer_lifetime_value'] < 404853.46)]
df3[['customer','customer_lifetime_value', 'total_claim_amount']]

     customer  customer_lifetime_value  total_claim_amount
17    OE15005                394524.16              647.44
23    TZ98966                245019.10              554.38
26    US89481                394637.21              799.20
38    CM61827                309003.41              648.00
42    IL19217                393900.64              882.87
62    FG63582                333976.49              863.33
135   MS41162                402296.35              975.11
140   DS81757                247012.12              721.24
158   KA61892                387364.70              701.71
160   ND87334                228759.69              679.37
170   TS19868                241313.97              542.32
184   AB13432                373583.81              792.00
204   FL34139                368811.09              669.68
250   IA63417                400151.91              773.47
269   VZ51506                359531.29              741.60
279   OH60605                365253.24              641.39
304   RR77985                288774.23              676.94
388   JF36291                387364.70              701.71
415   ZF84449                372672.80              806.40
448   NL93182                254945.00              845.65
450   WE68644                380392.18              668.29
467   AU96286                316765.84              662.40
486   FY51713                357076.05              614.68
500   XN11823                376446.51              842.44
502   PX17116                362345.42             1171.93
565   XS12556                368309.99              564.47
590   UK41984                383960.61              537.60
593   ZK21724                401654.20              799.20
638   DM95829                252395.96              623.22
645   JA41698                309953.80              862.76
669   ED50963                268886.40              541.70
709   NZ15548                402381.44              643.83
788   TE13577                231973.59              632.72
853   TV25678                354090.43              727.20
891   KJ87930                388650.48             1185.99
908   XM72420                391936.67              558.10
949   TD10493                289873.27              691.20
1019  OT52034                386477.68              707.30
1022  UI73201                366737.50              618.63
1068  GS98873                323912.47              633.60